#+TITLE: 20200320153757 Pxrac 2053 Odds Uat 503 Get
* Tags:
** projects: [[file:20200309102950-oddsapi.org][oddsAPI]], [[file:20200318102941-sprint_46.org][sprint 46]]
* Link: https://jira.phoenix.local/browse/PXRAC-2053
* Notes:
** Graylog: odds [[https://graylog.corporate.aws.phoenix/search?rangetype=relative&fields=message%2Csource&width=1920&highlightMessage=&relative=86400&q=kubernetes_labels_app%3Aapps%5C-uat%5C-live%5C-scoring%5C-odds%5C-api%20AND%20levelname%3AERROR][Graylog Web Interface]]
*** maybe useful queries:
- kubernetes_labels_app:apps\-uat\-live\-scoring\-odds\-api AND
  _exists_:response AND message:GET
- kubernetes_labels_app:apps\-uat\-live\-scoring\-odds\-api AND NOT
  _exists_:response AND message:GET
*** No luck at all looking for 503 errors
**** NOTE: We don't ever actually return a 503, it must be automatic
** Sample failing-sometimes url:
#+BEGIN_SRC restclient
GET https://live-scoring-uat.feeds-trading-sit.aws.phoenix/odds-api/odds/20200319AUPAK107?transactionid=TDT901f6c86-e4c3-4a2e-881a-45a72f759371
#+END_SRC

#+RESULTS:
#+begin_example
,#+BEGIN_SRC js
{
  "message": "OK",
  "response": {
    "raceidentifiercode": "20200319AUPAK107",
    "toteid": {
      "BA": {
        "poolid": {
        "WN": {
            "oddstypes": {
              "odds": {
                "combinations": [
                  {
                    "ck": "1",
                    "x": 3.79
                  },
                  {
                    "ck": "2",
                    "x": -1
                  },
                  {
                    "ck": "3",
                    "x": 36.35
                  },
                  {
                    "ck": "4",
                    "x": 5.79
                  },
                  {
                    "ck": "5",
                    "x": 17.19
                  },
                  {
                    "ck": "6",
                    "x": 80.45
                  },
                  {
                    "ck": "7",
                    "x": 18.23
                  },
                  {
                    "ck": "8",
                    "x": 21.38
                  },
                  {
                    "ck": "9",
                    "x": 2.52
                  },
                  {
                    "ck": "10",
                    "x": 87.19
                  },
                  {
                    "ck": "11",
                    "x": -1
                  }
                ],
                "vendortimestamputc": "2020-03-19T09:40:00.000000Z"
              }
            },
            "poolsize": {
              "vendorpoolsize": 0,
              "vendortimestamputc": "2020-03-19T09:40:00.000000Z"
            }
          }
        }
      },
    }
  },
  "transactionid": "TDT901f6c86-e4c3-4a2e-881a-45a72f759371"
}
// GET https://live-scoring-uat.feeds-trading-sit.aws.phoenix/odds-api/odds/20200319AUPAK107?transactionid=TDT901f6c86-e4c3-4a2e-881a-45a72f759371
// HTTP/1.1 200 OK
// Date: Fri, 20 Mar 2020 06:38:39 GMT
// Content-Type: application/json
// Content-Length: 72359
// Connection: keep-alive
// Server: nginx/1.15.6
// Vary: Accept-Encoding
// Request duration: 5.695112s
,#+END_SRC
#+end_example
